## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform
[command]/home/runner/work/_temp/d99e565b-15de-439f-8427-0bff0ffd71a3/terraform-bin show -no-color main.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_container_app_job.job will be updated in-place
  ~ resource "azurerm_container_app_job" "job" {
        id                           = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.App/jobs/biotrackr-auth-tokenrefresh"
        name                         = "biotrackr-auth-tokenrefresh"
        tags                         = {
            "Application" = "biotrackr"
            "Component"   = "Auth"
            "environment" = "Production"
            "owner"       = "willvelida"
        }
        # (8 unchanged attributes hidden)

      ~ template {
          ~ container {
              ~ image             = "acrbiotrackrprodae.azurecr.io/biotrackr-auth:c0b81ab7ba020f1c5a130e261770002eb9f74d96" -> "acrbiotrackrprodae.azurecr.io/biotrackr-auth:d5d11c63dc2e503c22d99463ba69416b6d8bc173"
                name              = "biotrackr-auth-tokenrefresh"
                # (5 unchanged attributes hidden)

              + env {
                  + name  = "keyvaulturl"
                  + value = "https://kv-biotrackr-prod-ae.vault.azure.net/"
                }
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.key_vault_secrets_officer_role.azurerm_role_assignment.role will be created
  + resource "azurerm_role_assignment" "role" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "db72fc8d-2c24-4f6c-a64f-0f2331cec9dc"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets Officer"
      + scope                            = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.KeyVault/vaults/kv-biotrackr-prod-ae"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A%0ATerraform will perform the following actions:%0A%0A  # azurerm_container_app_job.job will be updated in-place%0A  ~ resource "azurerm_container_app_job" "job" {%0A        id                           = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.App/jobs/biotrackr-auth-tokenrefresh"%0A        name                         = "biotrackr-auth-tokenrefresh"%0A        tags                         = {%0A            "Application" = "biotrackr"%0A            "Component"   = "Auth"%0A            "environment" = "Production"%0A            "owner"       = "willvelida"%0A        }%0A        # (8 unchanged attributes hidden)%0A%0A      ~ template {%0A          ~ container {%0A              ~ image             = "acrbiotrackrprodae.azurecr.io/biotrackr-auth:c0b81ab7ba020f1c5a130e261770002eb9f74d96" -> "acrbiotrackrprodae.azurecr.io/biotrackr-auth:d5d11c63dc2e503c22d99463ba69416b6d8bc173"%0A                name              = "biotrackr-auth-tokenrefresh"%0A                # (5 unchanged attributes hidden)%0A%0A              + env {%0A                  + name  = "keyvaulturl"%0A                  + value = "https://kv-biotrackr-prod-ae.vault.azure.net/"%0A                }%0A            }%0A        }%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # module.key_vault_secrets_officer_role.azurerm_role_assignment.role will be created%0A  + resource "azurerm_role_assignment" "role" {%0A      + id                               = (known after apply)%0A      + name                             = (known after apply)%0A      + principal_id                     = "db72fc8d-2c24-4f6c-a64f-0f2331cec9dc"%0A      + principal_type                   = "ServicePrincipal"%0A      + role_definition_id               = (known after apply)%0A      + role_definition_name             = "Key Vault Secrets Officer"%0A      + scope                            = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.KeyVault/vaults/kv-biotrackr-prod-ae"%0A      + skip_service_principal_aad_check = (known after apply)%0A    }%0A%0APlan: 1 to add, 1 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>